InformationRegisters/РасчетНалогаАУСН/РасчетНалогаАУСН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетНалогаАУСН</name>
  <comment>Расчет суммы налога при АУСН, выполненный  налоговым органом</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъектНалогообложения</name>
    <type>
      <types>EnumRef.ОбъектыНалогообложенияПоУСН</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Доходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗапроса</name>
    <comment>UTC</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНачисления</name>
    <comment>указывает на источник детальных данных расчета в НалоговыеНачисленияАУСН</comment>
    <type>
      <types>DefinedType.ИдентификаторНачисленияАУСН</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/ВидыРегламентныхОпераций/ВидыРегламентныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРегламентныхОпераций</name>
  <enumValues>
    <name>НачислениеЗарплаты</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеВзносовОтНесчастныхСлучаев</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеРезервовПоОплатеТруда</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеНДС</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияИИзносОС</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНУАрендныхПлатежей</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>АмортизацияНМАИсписаниеРасходовПоНИОКР</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиСпецодеждыИспецоснасткиВэксплуатации</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасходМатериаловДляВыпускаПродукции</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентныхРасходов</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентовПоКредитамЗаймам</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПереоценкаВалютныхСредств</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>КорректировкаСтоимостиНоменклатуры</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчета97</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТорговойНаценкиПоПроданнымТоварам</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовНаПриобретениеОСДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовНаПриобретениеНМАДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ИсключениеНЗПИзСоставаМатериальныхРасходовДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеДопРасходовДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеТаможенныхПлатежейДляУСН</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетТуристическогоНалога</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>РасчетДолейСписанияКосвенныхРасходов</name>
    <comment>2</comment>
  </enumValues>
  <enumValues>
    <name>ЗачетАвансаПоЕдиномуНалоговомуСчету</name>
    <comment>2</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетов20_23_25_26</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчета44</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РасчетРезервовПоСомнительнымДолгам</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ВключениеАвансовВПрочиеДоходыДляИП</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоВидамДеятельностиДляУСН</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоВидамДеятельностиДляИП</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеСтраховыхВзносовИП</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>РасчетРасходовУменьшающихОтдельныеНалоги</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ОбесценениеЗапасов</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетов90_91</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>ПереносУбытковПоНалогуНаПрибыль</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаПрибыль</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетОтложенногоНалога</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеНалогаАУСН</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетЕНВД</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РасчетНДФЛДляИП</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеНалогаНаПрофессиональныйДоход</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>РеформацияБаланса</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>ПереводОСВМалоценноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаФСБУ25</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>ПереходНаФСБУ6</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>ПереходНаФСБУ14</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>КорректировкаПартийПриПереходеСФИФОНаУчетПоСредней</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>НачислениеНалоговНаЕНС</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаОтложенногоНалога</name>
    <comment>6</comment>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеУчетныхРегистровУСН</name>
    <comment>6</comment>
  </enumValues>
</mdclass:Enum>

InformationRegisters/РасчетНалогаАУСН/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.НалоговыйПериод = РегистрыСведений.РасчетНалогаАУСН.НалоговыйПериод(Запись.НалоговыйПериод);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РасчетыАУСН = Новый Соответствие;
	ОтборПоОрганизации = Отбор.Найти("Организация");
	Если ОтборПоОрганизации <> Неопределено Тогда
		Организация = ОтборПоОрганизации.Значение;
		ОтборПоПериоду = Отбор.Найти("НалоговыйПериод");
		Если ОтборПоПериоду <> Неопределено Тогда
			РасчетыАУСН.Вставить(Организация, ОтборПоПериоду.Значение);
		КонецЕсли;
	КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		НайденныйПериод = РасчетыАУСН.Получить(Запись.Организация);
		Если НайденныйПериод <> Неопределено И НайденныйПериод > Запись.НалоговыйПериод Тогда
			РасчетыАУСН.Вставить(Запись.Организация, Запись.НалоговыйПериод);
		КонецЕсли;
	КонецЦикла;
	
	ВидРегламентнойОперации = Перечисления.ВидыРегламентныхОпераций.НачислениеНалогаАУСН;
	НомерГруппы = Перечисления.ВидыРегламентныхОпераций.НомерГруппы(ВидРегламентнойОперации);
	
	Для Каждого ЭлементРасчета Из РасчетыАУСН Цикл
		РегистрыСведений.НеактуальныеРегламентныеОперации.СдвинутьГраницуАктуальностиНазад(
			ЭлементРасчета.Ключ, ЭлементРасчета.Значение, НомерГруппы, ВидРегламентнойОперации, Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
